arendst/Tasmota/tasmota/tasmota_xdrv_driver/xdrv_81_0_esp32_webcam_CSI_isp.ino
/*
  xdrv_81_0_esp32_webcam_CSI_isp.ino - ESP32-P4 CSI ISP Configuration

  Copyright (C) 2025  Christian Baars and Theo Arends

  Runtime AE & CCM Implementation by Martin Macák - HexaMaster

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

/*********************************************************************************************\
 * ESP32-P4 Hardware ISP Configuration
 * 
 * Pure C++ implementation - no Berry dependencies
 * 
 * Responsibilities:
 * - Load and parse /isp.json from filesystem
 * - Apply ISP settings: CCM, Gamma, Sharpen, Color, BF (Bilateral Filter)
 * - Initialize and manage AWB (Auto White Balance) controller
 * - Run AWB processing loop (called from xdrv_81 core at 4Hz)
 * - Run AE processing loop (called from xdrv_81 core at 4Hz)
 * 
 * Graceful degradation:
 * - If isp.json is missing or malformed, ISP runs with bare minimum configuration
 * - Individual section failures are logged but don't stop other sections
\*********************************************************************************************/

#ifdef ESP32
#ifdef USE_CSI_WEBCAM

#include "esp_idf_version.h"
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)

#include "driver/isp.h"
#include "driver/isp_bf.h"
#include "driver/isp_sharpen.h"
#include "driver/isp_color.h"
#include "driver/isp_ccm.h"
#include "driver/isp_gamma.h"
#include "driver/isp_awb.h"
#include "driver/isp_ae.h"
#include "driver/isp_demosaic.h"

/*********************************************************************************************/

struct WcIspNormConfig {
  struct {
    bool present;
    float gamma_param;
    uint8_t y[16];
  } gamma;

  struct {
    bool present;
    int contrast_0_255;
    int saturation_0_255;
    int hue;
    int brightness;
  } color;

  struct {
    bool present;
    int target;
    int target_low;
    int target_high;
    bool weight_present;
    uint8_t weight[ISP_AE_BLOCK_X_NUM][ISP_AE_BLOCK_Y_NUM];
  } agc;

  struct {
    bool present;
    float table[3][3];
  } ccm;

  struct {
    bool present;
    uint8_t count;

    struct {
      uint16_t gain;
      uint8_t level;
      uint8_t matrix[3][3];
    } profile[8];
  } bf;
};

static WcIspNormConfig isp_norm_cfg;

// AWB state - file-static, used by init and C processing loop
static struct {
  isp_awb_ctlr_t  handle;
  bool            enabled;

  float           base_ccm[3][3];
  float           gain_r, gain_b;
  float           min_r_step;
  float           min_b_step;
  uint32_t        min_counted;

  float           last_applied_gain_r;
  float           last_applied_gain_b;

  bool            runtime_ccm_valid;
  volatile bool   stats_ready;
  volatile uint32_t stats_seq;
  volatile uint32_t cb_count;
  uint32_t        last_consumed_seq;
  isp_awb_stat_result_t latest_stats;
} isp_awb_state = {
  NULL, false,
  {{1,0,0},{0,1,0},{0,0,1}},
  1.0f, 1.0f,
  0.031f, 0.031f,
  2000,
  1.0f, 1.0f,
  false,
  false, 0, 0, 0, {}
};

static struct {
  isp_ae_ctlr_t handle;
  bool enabled;
  volatile bool stats_ready;
  volatile uint32_t stats_seq;
  volatile uint32_t cb_count;
  isp_ae_result_t latest_result;
  uint8_t weight[ISP_AE_BLOCK_X_NUM][ISP_AE_BLOCK_Y_NUM];
  int target;
  int target_low;
  int target_high;
  int last_luma;
  uint32_t last_apply_ms;
  uint32_t last_consumed_seq;
} isp_ae_state = { NULL, false, false, 0, 0, {}, {{0}}, 79, 62, 105, 0, 0, 0 };

static struct {
  bool enabled;
  int last_profile_idx;
  uint32_t last_apply_ms;
} isp_bf_state = { false, -1, 0 };

static struct {
  bool valid;
  uint16_t vts;
  uint16_t exposure_lines;
  uint16_t analog_gain;   // OV02C10 raw, 0x10 = 1x
  uint16_t digital_gain;  // OV02C10 raw, 0x0400 = 1x
} isp_sensor_ae_state = { false, 0, 0, 0x10, 0x0400 };
/*********************************************************************************************/
// Forward declarations

void WcIspApplyCCM(isp_proc_handle_t handle, JsonParserObject &sensor);
void WcIspApplyGamma(isp_proc_handle_t handle, JsonParserObject &sensor);
void WcIspApplySharpen(isp_proc_handle_t handle, JsonParserObject &sensor);
void WcIspApplyColor(isp_proc_handle_t handle, JsonParserObject &sensor);
void WcIspApplyBF(isp_proc_handle_t handle, JsonParserObject &sensor);
void WcIspApplyDemosaic(isp_proc_handle_t handle, JsonParserObject &sensor);
void WcIspInitAWB(isp_proc_handle_t handle, JsonParserObject &sensor, int width, int height);
void WcIspInitAE(isp_proc_handle_t handle, JsonParserObject &sensor, int width, int height);
void WcIspStartAE(void);
void WcIspAeProcess(void);
void WcIspDeinitAE(void);
void WcIspStartAWB(void);
static void WcIspApplyRuntimeCcm(void);

void WcIspResetNormConfig(void);
void WcIspParseNormConfig(JsonParserObject &sensor);
bool WcIspParseMatrix9(JsonParserToken mat_tok, float out[3][3]);
bool WcIspParseWeight25(JsonParserToken weight_tok, uint8_t out[ISP_AE_BLOCK_X_NUM][ISP_AE_BLOCK_Y_NUM]);
void WcIspBuildGammaYFromParam(float gamma_param, uint8_t out[16]);
void WcIspSetDefaultGammaY(uint8_t out[16]);

bool WcIspApplyBfProfile(isp_proc_handle_t handle, int idx);
void WcIspApplyRuntimeBf(void);
int WcIspSelectRuntimeBfProfile(uint16_t gain_x1);
uint16_t WcIspGetCurrentTotalGainX1(void);
void WcIspMirrorAeSeed(uint16_t vts, uint16_t exposure_lines, uint16_t analog_gain, uint16_t digital_gain);
static void WcIspMirrorAeApplyStep(int step);
/*********************************************************************************************/

static bool WcIspCheckRet(const char *tag, esp_err_t ret) {
  if (ret != ESP_OK) {
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: %s failed (0x%x)"), tag, ret);
    return false;
  }
  return true;
}

static uint8_t WcClampU8(int v, int lo, int hi) {
  if (v < lo) return (uint8_t)lo;
  if (v > hi) return (uint8_t)hi;
  return (uint8_t)v;
}

static int WcClampInt(int v, int lo, int hi) {
  if (v < lo) return lo;
  if (v > hi) return hi;
  return v;
}

static float WcClampFloat(float v, float lo, float hi) {
  if (v < lo) return lo;
  if (v > hi) return hi;
  return v;
}

void WcIspResetNormConfig(void) {
  memset(&isp_norm_cfg, 0, sizeof(isp_norm_cfg));

  isp_norm_cfg.gamma.present = false;
  isp_norm_cfg.gamma.gamma_param = 1.0f;
  WcIspSetDefaultGammaY(isp_norm_cfg.gamma.y);

