arendst/Tasmota/tasmota/tasmota_xdrv_driver/xdrv_81_0_esp32_webcam_CSI_isp.ino
  isp_norm_cfg.color.contrast_0_255 = 255;
  isp_norm_cfg.color.saturation_0_255 = 255;
  isp_norm_cfg.color.hue = 0;
  isp_norm_cfg.color.brightness = 0;

  isp_norm_cfg.bf.present = false;
  isp_norm_cfg.bf.count = 0;

  isp_norm_cfg.agc.target = 79;
  isp_norm_cfg.agc.target_low = 62;
  isp_norm_cfg.agc.target_high = 105;
  for (int x = 0; x < ISP_AE_BLOCK_X_NUM; x++) {
    for (int y = 0; y < ISP_AE_BLOCK_Y_NUM; y++) {
      isp_norm_cfg.agc.weight[x][y] = 1;
    }
  }

  isp_norm_cfg.ccm.table[0][0] = 1.0f;
  isp_norm_cfg.ccm.table[1][1] = 1.0f;
  isp_norm_cfg.ccm.table[2][2] = 1.0f;


}

bool WcIspParseMatrix9(JsonParserToken mat_tok, float out[3][3]) {
  if (!mat_tok || !mat_tok.isArray()) {
    return false;
  }

  JsonParserArray mat = mat_tok.getArray();
  int i = 0;
  for (auto v : mat) {
    if (i >= 9) break;
    out[i / 3][i % 3] = v.getFloat(0.0f);
    i++;
  }

  return i == 9;
}

bool WcIspParseWeight25(JsonParserToken weight_tok, uint8_t out[ISP_AE_BLOCK_X_NUM][ISP_AE_BLOCK_Y_NUM]) {
  if (!weight_tok || !weight_tok.isArray()) {
    return false;
  }

  JsonParserArray arr = weight_tok.getArray();
  int idx = 0;
  for (auto v : arr) {
    if (idx >= (ISP_AE_BLOCK_X_NUM * ISP_AE_BLOCK_Y_NUM)) break;
    int x = idx % ISP_AE_BLOCK_X_NUM;
    int y = idx / ISP_AE_BLOCK_X_NUM;
    out[x][y] = WcClampU8(v.getInt(1), 0, 255);
    idx++;
  }

  return idx == (ISP_AE_BLOCK_X_NUM * ISP_AE_BLOCK_Y_NUM);
}

void WcIspSetDefaultGammaY(uint8_t out[16]) {
  for (int i = 0; i < 16; i++) {
    out[i] = (uint8_t)((i * 255) / 15);
  }
}


void WcIspBuildGammaYFromParam(float gamma_param, uint8_t out[16]) {
  gamma_param = WcClampFloat(gamma_param, 0.05f, 5.0f);

  for (int i = 0; i < 16; i++) {
    float x = (float)((i * 255) / 15) / 255.0f;
    float y = powf(x, gamma_param) * 255.0f;
    int yi = (int)(y + 0.5f);
    out[i] = WcClampU8(yi, 0, 255);
  }

  out[0] = 0;
  out[15] = 255;
}


void WcIspParseNormConfig(JsonParserObject &sensor) {
  bool saturation_found = false;
  bool agc_weight_found = false;

  JsonParserToken ext_tok = sensor["ext"];
  if (ext_tok && ext_tok.isObject()) {
    JsonParserObject ext = ext_tok.getObject();
    isp_norm_cfg.color.hue = WcClampInt(ext.getInt("hue", 0), 0, 360);
    isp_norm_cfg.color.brightness = WcClampInt(ext.getInt("brightness", 0), -128, 127);
    isp_norm_cfg.color.present = true;
  }

  JsonParserToken aen_tok = sensor["aen"];
  if (aen_tok && aen_tok.isObject()) {
    JsonParserObject aen = aen_tok.getObject();

    JsonParserToken gamma_tok = aen["gamma"];
    if (gamma_tok && gamma_tok.isObject()) {
      JsonParserObject gamma_obj = gamma_tok.getObject();

      JsonParserToken gp_tok = gamma_obj["gamma_param"];
      if (gp_tok) {
        isp_norm_cfg.gamma.gamma_param = gamma_obj.getFloat("gamma_param", 1.0f);
        WcIspBuildGammaYFromParam(isp_norm_cfg.gamma.gamma_param, isp_norm_cfg.gamma.y);
        isp_norm_cfg.gamma.present = true;
      }
    }

    JsonParserToken con_tok = aen["contrast"];
    if (con_tok && con_tok.isArray()) {
      JsonParserArray con_arr = con_tok.getArray();
      int best_idx = WcIspFindNearest(con_arr, "gain", 1);
      if (best_idx >= 0 && con_arr[best_idx].isObject()) {
        JsonParserObject obj = con_arr[best_idx].getObject();
        isp_norm_cfg.color.contrast_0_255 = WcClampInt(obj.getInt("value", 255), 0, 255);
        isp_norm_cfg.color.present = true;
      }
    }

    JsonParserToken sat_legacy_tok = aen["saturation"];
    if (!saturation_found && sat_legacy_tok && sat_legacy_tok.isArray()) {
      JsonParserArray sat_arr = sat_legacy_tok.getArray();
      int best_idx = WcIspFindNearest(sat_arr, "gain", 1);
      if (best_idx >= 0 && sat_arr[best_idx].isObject()) {
        JsonParserObject obj = sat_arr[best_idx].getObject();
        isp_norm_cfg.color.saturation_0_255 = WcClampInt(obj.getInt("value", 255), 0, 255);
        isp_norm_cfg.color.present = true;
        saturation_found = true;
      }
    }
  }

  JsonParserToken acc_tok = sensor["acc"];
  if (acc_tok && acc_tok.isObject()) {
    JsonParserObject acc = acc_tok.getObject();

    JsonParserToken sat_tok = acc["saturation"];
    if (sat_tok && sat_tok.isArray()) {
      JsonParserArray sat_arr = sat_tok.getArray();
      int best_idx = WcIspFindNearest(sat_arr, "color_temp", 0);
      if (best_idx >= 0 && sat_arr[best_idx].isObject()) {
        JsonParserObject obj = sat_arr[best_idx].getObject();
        isp_norm_cfg.color.saturation_0_255 = WcClampInt(obj.getInt("value", 255), 0, 255);
        isp_norm_cfg.color.present = true;
        saturation_found = true;
      }
    }

  JsonParserToken adn_tok = sensor["adn"];
  if (adn_tok && adn_tok.isObject()) {
    JsonParserObject adn = adn_tok.getObject();

    JsonParserToken bf_tok = adn["bf"];
    if (bf_tok && bf_tok.isArray()) {
      JsonParserArray bf_arr = bf_tok.getArray();
      int count = 0;

      for (auto item_tok : bf_arr) {
        if (count >= 8) break;
        if (!item_tok.isObject()) continue;

        JsonParserObject item = item_tok.getObject();
        JsonParserToken param_tok = item["param"];
        if (!param_tok || !param_tok.isObject()) continue;

        JsonParserObject param = param_tok.getObject();

        isp_norm_cfg.bf.profile[count].gain =
            (uint16_t)WcClampInt(item.getInt("gain", 1), 1, 65535);
        isp_norm_cfg.bf.profile[count].level =
            WcClampU8(param.getInt("level", 5), 2, 20);

        JsonParserToken mat_tok = param["matrix"];
        if (!mat_tok || !mat_tok.isArray()) {
          continue;
        }

        JsonParserArray mat = mat_tok.getArray();
        int i = 0;
        for (auto v : mat) {
          if (i >= 9) break;
          isp_norm_cfg.bf.profile[count].matrix[i / 3][i % 3] =
              WcClampU8((int)v.getFloat(0), 0, 255);
          i++;
        }

        if (i == 9) {
          count++;
        }
      }

      if (count > 0) {
        isp_norm_cfg.bf.present = true;
        isp_norm_cfg.bf.count = count;
      }
    }
  }

    JsonParserToken ccm_tok = acc["ccm"];
    if (ccm_tok && ccm_tok.isObject()) {
      JsonParserObject ccm_obj = ccm_tok.getObject();

      JsonParserToken table_tok = ccm_obj["table"];
      if (table_tok && table_tok.isArray()) {
        JsonParserArray table = table_tok.getArray();
        int best_idx = WcIspFindNearest(table, "color_temp", 0);
        if (best_idx >= 0 && table[best_idx].isObject()) {
          JsonParserObject best = table[best_idx].getObject();
          if (WcIspParseMatrix9(best["matrix"], isp_norm_cfg.ccm.table)) {
            isp_norm_cfg.ccm.present = true;
          }
        }
      }
    }
  }

  JsonParserToken agc_tok = sensor["agc"];
  if (agc_tok && agc_tok.isObject()) {
    JsonParserObject agc = agc_tok.getObject();
    JsonParserToken luma_adj_tok = agc["luma_adjust"];
    if (luma_adj_tok && luma_adj_tok.isObject()) {
      JsonParserObject luma_adj = luma_adj_tok.getObject();

      isp_norm_cfg.agc.target = luma_adj.getInt("target", isp_norm_cfg.agc.target);
      isp_norm_cfg.agc.target_low = luma_adj.getInt("target_low", isp_norm_cfg.agc.target_low);
      isp_norm_cfg.agc.target_high = luma_adj.getInt("target_high", isp_norm_cfg.agc.target_high);

      if (WcIspParseWeight25(luma_adj["weight"], isp_norm_cfg.agc.weight)) {
        isp_norm_cfg.agc.weight_present = true;
        agc_weight_found = true;
      }

      isp_norm_cfg.agc.present = true;
    }
  }

