arendst/Tasmota/tasmota/tasmota_xdrv_driver/xdrv_81_0_esp32_webcam_CSI_isp.ino
  if (!agc_weight_found) {
    JsonParserToken ian_tok = sensor["ian"];
    if (ian_tok && ian_tok.isObject()) {
      JsonParserObject ian = ian_tok.getObject();
      JsonParserToken luma_tok = ian["luma"];
      if (luma_tok && luma_tok.isObject()) {
        JsonParserObject luma = luma_tok.getObject();
        JsonParserToken ae_tok = luma["ae"];
        if (ae_tok && ae_tok.isObject()) {
          JsonParserObject ae_obj = ae_tok.getObject();
          if (WcIspParseWeight25(ae_obj["weight"], isp_norm_cfg.agc.weight)) {
            isp_norm_cfg.agc.weight_present = true;
          }
        }
      }
    }
  }

  if (isp_norm_cfg.agc.target_low < 1) isp_norm_cfg.agc.target_low = 1;
  if (isp_norm_cfg.agc.target_low > 255) isp_norm_cfg.agc.target_low = 255;
  if (isp_norm_cfg.agc.target_high < 1) isp_norm_cfg.agc.target_high = 1;
  if (isp_norm_cfg.agc.target_high > 255) isp_norm_cfg.agc.target_high = 255;
  if (isp_norm_cfg.agc.target_high < isp_norm_cfg.agc.target_low) {
    isp_norm_cfg.agc.target_high = isp_norm_cfg.agc.target_low;
  }

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP norm cfg parsed (gamma=%d sat=%d agc_w=%d ccm=%d bf=%d)"),
         isp_norm_cfg.gamma.present ? 1 : 0,
         isp_norm_cfg.color.saturation_0_255,
         isp_norm_cfg.agc.weight_present ? 1 : 0,
         isp_norm_cfg.ccm.present ? 1 : 0,
         isp_norm_cfg.bf.count);
}

static void WcIspApplyRuntimeCcm() {
  isp_proc_handle_t isp = Wc.core.isp_handle;
  if (!isp) return;
  if (!isp_norm_cfg.ccm.present) return;

  bool gain_changed =
      (!isp_awb_state.runtime_ccm_valid) ||
      (fabsf(isp_awb_state.gain_r - isp_awb_state.last_applied_gain_r) >= 0.001f) ||
      (fabsf(isp_awb_state.gain_b - isp_awb_state.last_applied_gain_b) >= 0.001f);

  if (!gain_changed) {
    return;
  }

  esp_isp_ccm_config_t ccm_cfg;
  memset(&ccm_cfg, 0, sizeof(ccm_cfg));
  ccm_cfg.saturation = true;

  // base CCM + AWB trim
  for (int c = 0; c < 3; c++) {
    ccm_cfg.matrix[0][c] = isp_norm_cfg.ccm.table[0][c] * isp_awb_state.gain_r;
    ccm_cfg.matrix[1][c] = isp_norm_cfg.ccm.table[1][c];
    ccm_cfg.matrix[2][c] = isp_norm_cfg.ccm.table[2][c] * isp_awb_state.gain_b;
  }

  if (!WcIspCheckRet("ISP runtime CCM update", esp_isp_ccm_configure(isp, &ccm_cfg))) {
    return;
  }

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: CCM runtime gains R=%.3f B=%.3f"),
         isp_awb_state.gain_r,
         isp_awb_state.gain_b);

  isp_awb_state.runtime_ccm_valid = true;
  isp_awb_state.last_applied_gain_r = isp_awb_state.gain_r;
  isp_awb_state.last_applied_gain_b = isp_awb_state.gain_b;
}

static bool IRAM_ATTR WcIspAeOnStatisticsDone(isp_ae_ctlr_t ae_ctlr, const esp_isp_ae_env_detector_evt_data_t *edata, void *user_data) {
  if (!edata) {
    return false;
  }

  isp_ae_state.stats_seq++;
  isp_ae_state.latest_result = edata->ae_result;
  isp_ae_state.stats_seq++;
  isp_ae_state.stats_ready = true;
  isp_ae_state.cb_count++;

  return false;
}

static bool IRAM_ATTR WcIspAwbOnStatisticsDone(isp_awb_ctlr_t awb_ctlr, const esp_isp_awb_evt_data_t *edata, void *user_data) {
  if (!edata) {
    return false;
  }

  isp_awb_state.stats_seq++;
  isp_awb_state.latest_stats = edata->awb_result;
  isp_awb_state.stats_seq++;
  isp_awb_state.stats_ready = true;
  isp_awb_state.cb_count++;

  return false;
}
// Main entry point: Load isp.json and apply all ISP settings
// Called from WcSetup() in xdrv_81_0 after ISP handle is created
// Returns true if configuration was applied, false otherwise
bool WcIspApplyConfig(isp_proc_handle_t handle, const char* sensor_name, int width, int height) {
  if (!handle) {
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: ISP handle is NULL"));
    return false;
  }
  
  // Check if file exists
  if (!TfsFileExists("/isp.json")) {
    AddLog(LOG_LEVEL_INFO, PSTR("CAM: No isp.json found, using bare ISP"));
    return false;
  }
  
  // Get file size and allocate buffer
  size_t file_size = TfsFileSize("/isp.json");
  if (file_size == 0 || file_size > 4095) {
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: isp.json invalid size: %d"), file_size);
    return false;
  }
  
  size_t buf_size = file_size + 1;  // +1 for null terminator
  char *buf = (char*)malloc(buf_size);
  if (!buf) {
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: Failed to allocate %d bytes for JSON"), buf_size);
    return false;
  }
  
  // Load file directly into buffer
  memset(buf, 0, buf_size);
  if (!TfsLoadFile("/isp.json", (uint8_t*)buf, file_size)) {
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: Failed to load isp.json"));
    free(buf);
    return false;
  }
  
  // Parse JSON
  JsonParser parser(buf);
  JsonParserToken root = parser.getRoot();
  if (!root) {
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: isp.json parse failed"));
    free(buf);
    return false;
  }
  
  JsonParserObject root_obj = root.getObject();
  if (!root_obj) {
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: isp.json root is not an object"));
    free(buf);
    return false;
  }
  
  // Find sensor section
  JsonParserToken sensor_tok = root_obj[sensor_name];
  if (!sensor_tok || !sensor_tok.isObject()) {
    AddLog(LOG_LEVEL_INFO, PSTR("CAM: No ISP section for sensor %s"), sensor_name);
    free(buf);
    return false;
  }
  
  JsonParserObject sensor = sensor_tok.getObject();
  
  // Apply all ISP settings (each function handles its own errors gracefully)
  WcIspResetNormConfig();
  WcIspParseNormConfig(sensor);
  WcIspApplyDemosaic(handle, sensor);
  WcIspApplyGamma(handle, sensor);
  WcIspApplySharpen(handle, sensor);
  WcIspApplyColor(handle, sensor);
  WcIspApplyBF(handle, sensor);
  WcIspApplyCCM(handle, sensor);
  WcIspInitAWB(handle, sensor, width, height);
  WcIspInitAE(handle, sensor, width, height);
  
  free(buf);
  return true;
}

/*********************************************************************************************/

// Helper: Find nearest entry in array by numeric key
// Returns index of nearest entry, or -1 if not found
int WcIspFindNearest(JsonParserArray &arr, const char* key, int target_value) {
  if (!arr) return -1;
  
  int best_idx = -1;
  int best_dist = INT_MAX;
  int idx = 0;
  
  for (auto entry_tok : arr) {
    if (!entry_tok.isObject()) {
      idx++;
      continue;
    }
    
    JsonParserObject entry = entry_tok.getObject();
    JsonParserToken val_tok = entry[key];
    if (!val_tok) {
      idx++;
      continue;
    }
    
    int val = val_tok.getInt();
    int dist = abs(val - target_value);
    if (dist < best_dist) {
      best_dist = dist;
      best_idx = idx;
    }
    idx++;
  }
  
  return best_idx;
}

/*********************************************************************************************/

// Apply CCM (Color Correction Matrix)
// JSON: {"acc": {"ccm": {"table": [{"color_temp": 6500, "matrix": [flat 9 floats]}, ...]}}
void WcIspApplyCCM(isp_proc_handle_t handle, JsonParserObject &sensor) {
  (void)sensor;

  if (!isp_norm_cfg.ccm.present) {
    return;
  }

  esp_isp_ccm_config_t cfg;
  memset(&cfg, 0, sizeof(cfg));
  cfg.saturation = true;

  for (int r = 0; r < 3; r++) {
    for (int c = 0; c < 3; c++) {
      cfg.matrix[r][c] = isp_norm_cfg.ccm.table[r][c];
      isp_awb_state.base_ccm[r][c] = isp_norm_cfg.ccm.table[r][c];
    }
  }

  if (!WcIspCheckRet("ISP CCM configure", esp_isp_ccm_configure(handle, &cfg))) {
    return;
  }
  if (!WcIspCheckRet("ISP CCM enable", esp_isp_ccm_enable(handle))) {
    return;
  }

