arendst/Tasmota/tasmota/tasmota_xdrv_driver/xdrv_81_0_esp32_webcam_CSI_isp.ino
    AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP CCM profile matrix applied"));
}

/*********************************************************************************************/

void WcIspApplyDemosaic(isp_proc_handle_t handle, JsonParserObject &sensor) {
  JsonParserToken adn_tok = sensor["adn"];
  if (!adn_tok || !adn_tok.isObject()) {
    return;
  }

  JsonParserObject adn = adn_tok.getObject();
  JsonParserToken dm_tok = adn["demosaic"];
  if (!dm_tok || !dm_tok.isArray()) {
    return;
  }

  JsonParserArray dm_arr = dm_tok.getArray();

  int best_idx = WcIspFindNearest(dm_arr, "gain", 1);
  if (best_idx < 0) {
    return;
  }

  JsonParserToken best_tok = dm_arr[best_idx];
  if (!best_tok.isObject()) {
    return;
  }

  JsonParserObject best = best_tok.getObject();
  float grad_ratio = WcClampFloat(best.getFloat("gradient_ratio", 1.25f), 0.0f, 15.996f);

  esp_isp_demosaic_config_t cfg;
  memset(&cfg, 0, sizeof(cfg));

  cfg.grad_ratio.integer = (uint8_t)grad_ratio;
  cfg.grad_ratio.decimal = (uint8_t)((grad_ratio - (int)grad_ratio) * 256.0f);

  if (!WcIspCheckRet("ISP Demosaic configure", esp_isp_demosaic_configure(handle, &cfg))) {
    return;
  }
  if (!WcIspCheckRet("ISP Demosaic enable", esp_isp_demosaic_enable(handle))) {
    return;
  }

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP Demosaic applied (gain=1, grad=%.3f)"), grad_ratio);
}
/*********************************************************************************************/

bool WcIspApplyBfProfile(isp_proc_handle_t handle, int idx) {
  if (!handle) return false;
  if (!isp_norm_cfg.bf.present) return false;
  if (idx < 0 || idx >= isp_norm_cfg.bf.count) return false;

  esp_isp_bf_config_t cfg;
  memset(&cfg, 0, sizeof(cfg));

  cfg.denoising_level = isp_norm_cfg.bf.profile[idx].level;
  cfg.padding_mode = ISP_BF_EDGE_PADDING_MODE_SRND_DATA;

  for (int r = 0; r < 3; r++) {
    for (int c = 0; c < 3; c++) {
      cfg.bf_template[r][c] = isp_norm_cfg.bf.profile[idx].matrix[r][c];
    }
  }

  if (!WcIspCheckRet("ISP BF configure", esp_isp_bf_configure(handle, &cfg))) {
    return false;
  }

  return true;
}

uint16_t WcIspGetCurrentTotalGainX1(void) {
  if (!isp_sensor_ae_state.valid) {
    return 1;
  }

  // total gain ~= (analog_gain / 16.0) * (digital_gain / 1024.0)
  uint32_t num = (uint32_t)isp_sensor_ae_state.analog_gain *
                 (uint32_t)isp_sensor_ae_state.digital_gain;

  uint32_t gain_x1 = (num + (16U * 1024U / 2U)) / (16U * 1024U);

  if (gain_x1 < 1U) gain_x1 = 1U;
  if (gain_x1 > 65535U) gain_x1 = 65535U;

  return (uint16_t)gain_x1;
}

int WcIspSelectRuntimeBfProfile(uint16_t gain_x1) {
  if (!isp_norm_cfg.bf.present || isp_norm_cfg.bf.count == 0) {
    return -1;
  }

  int idx = 0;
  for (int i = 0; i < isp_norm_cfg.bf.count; i++) {
    if (gain_x1 >= isp_norm_cfg.bf.profile[i].gain) {
      idx = i;
    } else {
      break;
    }
  }
  return idx;
}

void WcIspMirrorAeSeed(uint16_t vts, uint16_t exposure_lines, uint16_t analog_gain, uint16_t digital_gain) {
  isp_sensor_ae_state.valid = true;
  isp_sensor_ae_state.vts = vts;
  isp_sensor_ae_state.exposure_lines = exposure_lines;
  isp_sensor_ae_state.analog_gain = analog_gain;
  isp_sensor_ae_state.digital_gain = digital_gain;
}

static void WcIspMirrorAeApplyStep(int step) {
  if (!isp_sensor_ae_state.valid) return;
  if (step == 0) return;

  int exp_delta = 16;
  int again_delta = 4;
  int dgain_delta = 0x40;

  if (step == 2 || step == -2) {
    exp_delta = 48;
    again_delta = 8;
    dgain_delta = 0x80;
  } else if (step == 3 || step == -3) {
    exp_delta = 96;
    again_delta = 16;
    dgain_delta = 0x100;
  }

  uint16_t max_exp = (isp_sensor_ae_state.vts > 8) ? (isp_sensor_ae_state.vts - 8) : 4;
  if (max_exp < 4) max_exp = 4;

  if (step > 0) {
    if (isp_sensor_ae_state.exposure_lines < max_exp) {
      uint32_t v = isp_sensor_ae_state.exposure_lines + exp_delta;
      if (v > max_exp) v = max_exp;
      isp_sensor_ae_state.exposure_lines = (uint16_t)v;
    } else if (isp_sensor_ae_state.analog_gain < 0xF8) {
      uint32_t v = isp_sensor_ae_state.analog_gain + again_delta;
      if (v > 0xF8) v = 0xF8;
      isp_sensor_ae_state.analog_gain = (uint16_t)v;
    } else {
      uint32_t v = isp_sensor_ae_state.digital_gain + dgain_delta;
      if (v > 0x3FFF) v = 0x3FFF;
      isp_sensor_ae_state.digital_gain = (uint16_t)v;
    }
  } else {
    if (isp_sensor_ae_state.digital_gain > 0x0400) {
      int32_t v = (int32_t)isp_sensor_ae_state.digital_gain - dgain_delta;
      if (v < 0x0400) v = 0x0400;
      isp_sensor_ae_state.digital_gain = (uint16_t)v;
    } else if (isp_sensor_ae_state.analog_gain > 0x10) {
      int32_t v = (int32_t)isp_sensor_ae_state.analog_gain - again_delta;
      if (v < 0x10) v = 0x10;
      isp_sensor_ae_state.analog_gain = (uint16_t)v;
    } else {
      int32_t v = (int32_t)isp_sensor_ae_state.exposure_lines - exp_delta;
      if (v < 4) v = 4;
      isp_sensor_ae_state.exposure_lines = (uint16_t)v;
    }
  }
}

void WcIspApplyRuntimeBf(void) {
  if (!isp_bf_state.enabled) return;
  if (!isp_norm_cfg.bf.present) return;

  isp_proc_handle_t isp = Wc.core.isp_handle;
  if (!isp) return;

  uint16_t gain_x1 = WcIspGetCurrentTotalGainX1();
  int idx = WcIspSelectRuntimeBfProfile(gain_x1);
  if (idx < 0) return;

  if (idx == isp_bf_state.last_profile_idx) {
    return;
  }

  uint32_t now = millis();
  if ((now - isp_bf_state.last_apply_ms) < 120) {
    return;
  }

  if (!WcIspApplyBfProfile(isp, idx)) {
    return;
  }

  isp_bf_state.last_profile_idx = idx;
  isp_bf_state.last_apply_ms = now;

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: Runtime BF -> idx=%d gain=%u level=%u"),
         idx,
         gain_x1,
         isp_norm_cfg.bf.profile[idx].level);
}

/*********************************************************************************************/

void WcIspStartAE(void) {
  if (!isp_ae_state.enabled || !isp_ae_state.handle) {
    AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP AE start skipped - not ready"));
    return;
  }

  isp_ae_state.stats_ready = false;
  isp_ae_state.stats_seq = 0;
  isp_ae_state.cb_count = 0;
  isp_ae_state.last_consumed_seq = 0;
  isp_ae_state.last_luma = 0;
  memset(&isp_ae_state.latest_result, 0, sizeof(isp_ae_state.latest_result));

