arendst/Tasmota/tasmota/tasmota_xdrv_driver/xdrv_81_0_esp32_webcam_CSI_isp.ino
  esp_err_t ret = esp_isp_ae_controller_start_continuous_statistics(isp_ae_state.handle);
  if (ret != ESP_OK) {
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: ISP AE continuous start failed (0x%x)"), ret);
    return;
  }

  AddLog(LOG_LEVEL_INFO, PSTR("CAM: ISP AE continuous started AFTER stream start"));
}

void WcIspInitAE(isp_proc_handle_t handle, JsonParserObject &sensor, int width, int height) {
  memset(isp_ae_state.weight, 0, sizeof(isp_ae_state.weight));
  for (int x = 0; x < ISP_AE_BLOCK_X_NUM; x++) {
    for (int y = 0; y < ISP_AE_BLOCK_Y_NUM; y++) {
      isp_ae_state.weight[x][y] = 1;
    }
  }

  isp_ae_state.target = 79;
  isp_ae_state.target_low = 62;
  isp_ae_state.target_high = 105;
  isp_ae_state.last_luma = 0;
  isp_ae_state.last_apply_ms = 0;
  isp_ae_state.stats_ready = false;
  isp_ae_state.stats_seq = 0;
  isp_ae_state.cb_count = 0;
  isp_ae_state.last_consumed_seq = 0;
  memset(&isp_ae_state.latest_result, 0, sizeof(isp_ae_state.latest_result));

  (void)sensor;

  isp_ae_state.target = isp_norm_cfg.agc.target;
  isp_ae_state.target_low = isp_norm_cfg.agc.target_low;
  isp_ae_state.target_high = isp_norm_cfg.agc.target_high;

  for (int x = 0; x < ISP_AE_BLOCK_X_NUM; x++) {
    for (int y = 0; y < ISP_AE_BLOCK_Y_NUM; y++) {
      isp_ae_state.weight[x][y] = isp_norm_cfg.agc.weight[x][y];
    }
  }

  if (isp_ae_state.target_low < 1) isp_ae_state.target_low = 1;
  if (isp_ae_state.target_low > 255) isp_ae_state.target_low = 255;
  if (isp_ae_state.target_high < 1) isp_ae_state.target_high = 1;
  if (isp_ae_state.target_high > 255) isp_ae_state.target_high = 255;
  if (isp_ae_state.target_high < isp_ae_state.target_low) {
    isp_ae_state.target_high = isp_ae_state.target_low;
  }

  if (isp_ae_state.handle) {
    esp_isp_ae_controller_stop_continuous_statistics(isp_ae_state.handle);
    esp_isp_ae_controller_disable(isp_ae_state.handle);
    esp_isp_del_ae_controller(isp_ae_state.handle);
    isp_ae_state.handle = NULL;
    isp_ae_state.enabled = false;
  }

  esp_isp_ae_config_t ae_cfg;
  memset(&ae_cfg, 0, sizeof(ae_cfg));
  ae_cfg.sample_point = ISP_AE_SAMPLE_POINT_AFTER_DEMOSAIC;

  ae_cfg.window.top_left.x = 0;
  ae_cfg.window.top_left.y = 0;
  ae_cfg.window.btm_right.x = width;
  ae_cfg.window.btm_right.y = height;

  isp_ae_ctlr_t ctlr = NULL;
  esp_err_t ret = esp_isp_new_ae_controller(handle, &ae_cfg, &ctlr);
  if (ret != ESP_OK) {
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: ISP AE init failed (0x%x)"), ret);
    return;
  }

  esp_isp_ae_env_detector_evt_cbs_t ae_cbs = {
    .on_env_statistics_done = WcIspAeOnStatisticsDone,
    .on_env_change = NULL,
  };

  ret = esp_isp_ae_env_detector_register_event_callbacks(ctlr, &ae_cbs, NULL);
  if (ret != ESP_OK) {
    esp_isp_del_ae_controller(ctlr);
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: ISP AE cb reg failed (0x%x)"), ret);
    return;
  }

  ret = esp_isp_ae_controller_enable(ctlr);
  if (ret != ESP_OK) {
    esp_isp_del_ae_controller(ctlr);
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: ISP AE enable failed (0x%x)"), ret);
    return;
  }

  // AE only after stream on

  isp_ae_state.handle = ctlr;
  isp_ae_state.enabled = true;

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP AE initialized (prepared, waiting for stream) target=%d low=%d high=%d win=%dx%d"),
         isp_ae_state.target, isp_ae_state.target_low, isp_ae_state.target_high, width, height);
}

void WcIspAeProcess(void) {

  if (!isp_ae_state.enabled || !isp_ae_state.handle) {
    return;
  }
  if (!isp_ae_state.stats_ready) {
    return;
  }

  uint32_t seq1 = isp_ae_state.stats_seq;
  if (seq1 & 1) {
    return;
  }

  isp_ae_result_t result = isp_ae_state.latest_result;

  uint32_t seq2 = isp_ae_state.stats_seq;
  if (seq1 != seq2 || (seq2 & 1)) {
    return;
  }

  if (seq2 == isp_ae_state.last_consumed_seq) {
    return;
  }
  isp_ae_state.last_consumed_seq = seq2;

  uint32_t weighted_sum = 0;
  uint32_t weight_sum = 0;

  for (int x = 0; x < ISP_AE_BLOCK_X_NUM; x++) {
    for (int y = 0; y < ISP_AE_BLOCK_Y_NUM; y++) {
      uint32_t w = isp_ae_state.weight[x][y];
      weighted_sum += (uint32_t)result.luminance[x][y] * w;
      weight_sum += w;
    }
  }

  if (weight_sum == 0) {
    return;
  }

  isp_ae_state.last_luma = weighted_sum / weight_sum;

  AddLog(LOG_LEVEL_INFO, PSTR("CAM: AE cb=%u luma=%d target=%d band=%d..%d"),
         isp_ae_state.cb_count,
         isp_ae_state.last_luma,
         isp_ae_state.target,
         isp_ae_state.target_low,
         isp_ae_state.target_high);

  if (isp_ae_state.last_luma >= isp_ae_state.target_low &&
      isp_ae_state.last_luma <= isp_ae_state.target_high) {
    return;
  }

  uint32_t now = millis();
  if ((now - isp_ae_state.last_apply_ms) < 150) {
    return;
  }

  int err = isp_ae_state.target - isp_ae_state.last_luma;
  int step = 0;

  if (err > 32) {
    step = 3;
  } else if (err > 16) {
    step = 2;
  } else if (err > 4) {
    step = 1;
  } else if (err < -32) {
    step = -3;
  } else if (err < -16) {
    step = -2;
  } else if (err < -4) {
    step = -1;
  }

  if (step == 0) {
    return;
  }

  AddLog(LOG_LEVEL_INFO, PSTR("CAM: AE step=%d"), step);

  int32_t berry_result = callBerryEventDispatcher(PSTR("camera"), PSTR("ae"), step, nullptr, 0);

  AddLog(LOG_LEVEL_INFO, PSTR("CAM: AE dispatch result=%d"), berry_result);

  if (berry_result != 0) {
    WcIspMirrorAeApplyStep(step);
    isp_ae_state.last_apply_ms = now;
  }
}

void WcIspDeinitAE(void) {
  if (!isp_ae_state.handle) {
    isp_ae_state.enabled = false;
    isp_ae_state.stats_ready = false;
    isp_ae_state.stats_seq = 0;
    isp_ae_state.cb_count = 0;
    isp_ae_state.last_consumed_seq = 0;
    memset(&isp_ae_state.latest_result, 0, sizeof(isp_ae_state.latest_result));
    isp_ae_state.last_luma = 0;
    isp_ae_state.last_apply_ms = 0;
    return;
  }

  esp_isp_ae_controller_stop_continuous_statistics(isp_ae_state.handle);
  esp_isp_ae_controller_disable(isp_ae_state.handle);
  esp_isp_del_ae_controller(isp_ae_state.handle);

  isp_ae_state.handle = NULL;
  isp_ae_state.enabled = false;
  isp_ae_state.stats_ready = false;
  isp_ae_state.stats_seq = 0;
  isp_ae_state.cb_count = 0;
  isp_ae_state.last_consumed_seq = 0;
  memset(&isp_ae_state.latest_result, 0, sizeof(isp_ae_state.latest_result));
  isp_ae_state.last_luma = 0;
  isp_ae_state.last_apply_ms = 0;

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP AE deinitialized"));
}

/*********************************************************************************************/

uint32_t WcIspGammaInterp(uint32_t x) {
  uint32_t seg = (x * 15) / 255;
  if (seg >= 15) return Wc.core.isp_gamma_y[15];
  uint32_t x0 = seg * 255 / 15;
  uint32_t x1 = (seg + 1) * 255 / 15;
  uint32_t y0 = Wc.core.isp_gamma_y[seg];
  uint32_t y1 = Wc.core.isp_gamma_y[seg + 1];
  uint32_t dx = x1 - x0;
  return dx ? y0 + (y1 - y0) * (x - x0) / dx : y0;
}

// Apply Gamma Curve
void WcIspApplyGamma(isp_proc_handle_t handle, JsonParserObject &sensor) {
  (void)sensor;

  if (!isp_norm_cfg.gamma.present) {
    return;
  }

  for (int i = 0; i < 16; i++) {
    Wc.core.isp_gamma_y[i] = isp_norm_cfg.gamma.y[i];
  }

  isp_gamma_curve_points_t pts = {};
  esp_isp_gamma_fill_curve_points(WcIspGammaInterp, &pts);

