arendst/Tasmota/tasmota/tasmota_xdrv_driver/xdrv_81_0_esp32_webcam_CSI_isp.ino
  if (!WcIspCheckRet("ISP Gamma configure R", esp_isp_gamma_configure(handle, COLOR_COMPONENT_R, &pts))) {
    return;
  }
  if (!WcIspCheckRet("ISP Gamma configure G", esp_isp_gamma_configure(handle, COLOR_COMPONENT_G, &pts))) {
    return;
  }
  if (!WcIspCheckRet("ISP Gamma configure B", esp_isp_gamma_configure(handle, COLOR_COMPONENT_B, &pts))) {
    return;
  }
  if (!WcIspCheckRet("ISP Gamma enable", esp_isp_gamma_enable(handle))) {
    return;
  }

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP Gamma applied (gamma=%.3f y1=%d y15=%d)"),
         isp_norm_cfg.gamma.gamma_param,
         (int)Wc.core.isp_gamma_y[1],
         (int)Wc.core.isp_gamma_y[15]);
}
/*********************************************************************************************/

// Apply Sharpen Filter
// JSON: {"aen": {"sharpen": [{"gain": 1, "param": {"h_thresh":..., "l_thresh":..., "h_coeff":..., "m_coeff":..., "matrix":[...]}}]}}
void WcIspApplySharpen(isp_proc_handle_t handle, JsonParserObject &sensor) {
  JsonParserToken aen_tok = sensor["aen"];
  if (!aen_tok || !aen_tok.isObject()) return;

  JsonParserObject aen = aen_tok.getObject();
  JsonParserToken sh_tok = aen["sharpen"];
  if (!sh_tok || !sh_tok.isArray()) return;

  JsonParserArray sh_arr = sh_tok.getArray();
  int best_idx = WcIspFindNearest(sh_arr, "gain", 1);
  if (best_idx < 0) return;

  JsonParserToken best_tok = sh_arr[best_idx];
  if (!best_tok.isObject()) return;

  JsonParserObject best = best_tok.getObject();
  JsonParserToken param_tok = best["param"];
  if (!param_tok || !param_tok.isObject()) return;

  JsonParserObject param = param_tok.getObject();

  esp_isp_sharpen_config_t cfg;
  memset(&cfg, 0, sizeof(cfg));

  cfg.h_thresh = WcClampU8(param.getInt("h_thresh", 255), 0, 255);
  cfg.l_thresh = WcClampU8(param.getInt("l_thresh", 128), 0, 255);

  float h_coeff = WcClampFloat(param.getFloat("h_coeff", 1.0f), 0.0f, 15.996f);
  cfg.h_freq_coeff.integer = (uint8_t)h_coeff;
  cfg.h_freq_coeff.decimal = (uint8_t)((h_coeff - (int)h_coeff) * 256.0f);

  float m_coeff = WcClampFloat(param.getFloat("m_coeff", 1.0f), 0.0f, 15.996f);
  cfg.m_freq_coeff.integer = (uint8_t)m_coeff;
  cfg.m_freq_coeff.decimal = (uint8_t)((m_coeff - (int)m_coeff) * 256.0f);

  JsonParserToken mat_tok = param["matrix"];
  if (mat_tok && mat_tok.isArray()) {
    JsonParserArray mat = mat_tok.getArray();
    int i = 0;
    for (auto v : mat) {
      if (i >= 9) break;
      cfg.sharpen_template[i / 3][i % 3] = WcClampU8((int)v.getFloat(0), 0, 255);
      i++;
    }
  }

  cfg.padding_mode = ISP_SHARPEN_EDGE_PADDING_MODE_SRND_DATA;

  if (!WcIspCheckRet("ISP Sharpen configure", esp_isp_sharpen_configure(handle, &cfg))) {
    return;
  }
  if (!WcIspCheckRet("ISP Sharpen enable", esp_isp_sharpen_enable(handle))) {
    return;
  }

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP Sharpen applied (gain=1)"));
}

/*********************************************************************************************/

template<typename T>
static void WcIspSetFixed01(uint8_t src_0_255, T *dst) {
  uint32_t q7 = ((uint32_t)src_0_255 * 128U + 127U) / 255U;  // 0..128
  if (q7 > 128U) q7 = 128U;

  if (q7 >= 128U) {
    dst->integer = 1;
    dst->decimal = 0;
  } else {
    dst->integer = 0;
    dst->decimal = q7;   // 0..127
  }
}

// Apply Color Adjustment
// JSON: {"ext": {"hue":0, "brightness":0}, "aen": {"contrast": [{"gain":1, "value":128}]}}
void WcIspApplyColor(isp_proc_handle_t handle, JsonParserObject &sensor) {
  (void)sensor;

  esp_isp_color_config_t cfg;
  memset(&cfg, 0, sizeof(cfg));

  cfg.color_contrast.integer = 1;
  cfg.color_contrast.decimal = 0;
  cfg.color_saturation.integer = 1;
  cfg.color_saturation.decimal = 0;
  cfg.color_hue = 0;
  cfg.color_brightness = 0;

  WcIspSetFixed01((uint8_t)WcClampInt(isp_norm_cfg.color.contrast_0_255, 0, 255), &cfg.color_contrast);
  WcIspSetFixed01((uint8_t)WcClampInt(isp_norm_cfg.color.saturation_0_255, 0, 255), &cfg.color_saturation);

  cfg.color_hue = WcClampInt(isp_norm_cfg.color.hue, 0, 360);
  cfg.color_brightness = WcClampInt(isp_norm_cfg.color.brightness, -128, 127);

  if (!WcIspCheckRet("ISP Color configure", esp_isp_color_configure(handle, &cfg))) {
    return;
  }
  if (!WcIspCheckRet("ISP Color enable", esp_isp_color_enable(handle))) {
    return;
  }

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP Color applied (contrast=%d saturation=%d hue=%d brightness=%d)"),
         isp_norm_cfg.color.contrast_0_255,
         isp_norm_cfg.color.saturation_0_255,
         isp_norm_cfg.color.hue,
         isp_norm_cfg.color.brightness);
}

/*********************************************************************************************/

// Apply Bilateral Filter (Denoising)
// JSON: {"adn": {"bf": [{"gain":1, "param": {"level":2, "matrix":[flat 9]}}]}}
void WcIspApplyBF(isp_proc_handle_t handle, JsonParserObject &sensor) {
  (void)sensor;

  if (!isp_norm_cfg.bf.present || isp_norm_cfg.bf.count == 0) {
    isp_bf_state.enabled = false;
    isp_bf_state.last_profile_idx = -1;
    isp_bf_state.last_apply_ms = 0;
    return;
  }

  if (!WcIspApplyBfProfile(handle, 0)) {
    isp_bf_state.enabled = false;
    isp_bf_state.last_profile_idx = -1;
    isp_bf_state.last_apply_ms = 0;
    return;
  }

  if (!WcIspCheckRet("ISP BF enable", esp_isp_bf_enable(handle))) {
    isp_bf_state.enabled = false;
    isp_bf_state.last_profile_idx = -1;
    isp_bf_state.last_apply_ms = 0;
    return;
  }

  isp_bf_state.enabled = true;
  isp_bf_state.last_profile_idx = 0;
  isp_bf_state.last_apply_ms = millis();

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP BF applied (init profile gain=%u level=%u)"),
         isp_norm_cfg.bf.profile[0].gain,
         isp_norm_cfg.bf.profile[0].level);
}

/*********************************************************************************************/

// Initialize AWB (Auto White Balance)
// JSON: {"awb": {"range": {"green":{min,max}, "rg":{min,max}, "bg":{min,max}}, "min_red_gain_step":..., "min_blue_gain_step":..., "min_counted":...}}
void WcIspInitAWB(isp_proc_handle_t handle, JsonParserObject &sensor, int width, int height) {
  JsonParserToken awb_tok = sensor["awb"];
  if (!awb_tok || !awb_tok.isObject()) return;
  JsonParserObject awb = awb_tok.getObject();

