arendst/Tasmota/tasmota/tasmota_xdrv_driver/xdrv_81_0_esp32_webcam_CSI_isp.ino
  if (isp_awb_state.handle) {
    esp_isp_awb_controller_disable(isp_awb_state.handle);
    esp_isp_del_awb_controller(isp_awb_state.handle);
    isp_awb_state.handle = NULL;
    isp_awb_state.enabled = false;
  }

  JsonParserToken range_tok = awb["range"];
  if (!range_tok || !range_tok.isObject()) return;
  JsonParserObject range = range_tok.getObject();

  JsonParserToken green_tok = range["green"];
  JsonParserToken rg_tok = range["rg"];
  JsonParserToken bg_tok = range["bg"];
  if (!green_tok || !green_tok.isObject() || !rg_tok || !rg_tok.isObject() || !bg_tok || !bg_tok.isObject()) {
    AddLog(LOG_LEVEL_INFO, PSTR("CAM: ISP AWB skipped - incomplete range object"));
    return;
  }

  JsonParserObject green_obj = green_tok.getObject();
  JsonParserObject rg_obj = rg_tok.getObject();
  JsonParserObject bg_obj = bg_tok.getObject();

  int lum_min = WcClampInt(green_obj.getInt("min", 128), 0, 255);
  int lum_max = WcClampInt(green_obj.getInt("max", 240), 0, 255);
  if (lum_max < lum_min) lum_max = lum_min;

  float rg_min = WcClampFloat(rg_obj.getFloat("min", 0.7f), 0.0f, 8.0f);
  float rg_max = WcClampFloat(rg_obj.getFloat("max", 1.3f), 0.0f, 8.0f);
  float bg_min = WcClampFloat(bg_obj.getFloat("min", 0.7f), 0.0f, 8.0f);
  float bg_max = WcClampFloat(bg_obj.getFloat("max", 1.3f), 0.0f, 8.0f);

  int x1 = width / 10;
  int y1 = height / 10;
  int x2 = width - width / 10;
  int y2 = height - height / 10;

  int sp = awb.getInt("sample_point", (int)ISP_AWB_SAMPLE_POINT_AFTER_CCM);
  if (sp != (int)ISP_AWB_SAMPLE_POINT_BEFORE_CCM &&
      sp != (int)ISP_AWB_SAMPLE_POINT_AFTER_CCM) {
    sp = (int)ISP_AWB_SAMPLE_POINT_AFTER_CCM;
  }

  esp_isp_awb_config_t awb_cfg;
  memset(&awb_cfg, 0, sizeof(awb_cfg));
  awb_cfg.sample_point = (isp_awb_sample_point_t)sp;
  awb_cfg.window.top_left.x = x1;
  awb_cfg.window.top_left.y = y1;
  awb_cfg.window.btm_right.x = x2;
  awb_cfg.window.btm_right.y = y2;
  awb_cfg.subwindow = awb_cfg.window;
  awb_cfg.white_patch.luminance.min = (uint32_t)lum_min;
  awb_cfg.white_patch.luminance.max = (uint32_t)lum_max;
  awb_cfg.white_patch.red_green_ratio.min = rg_min;
  awb_cfg.white_patch.red_green_ratio.max = rg_max;
  awb_cfg.white_patch.blue_green_ratio.min = bg_min;
  awb_cfg.white_patch.blue_green_ratio.max = bg_max;

  isp_awb_ctlr_t ctlr = NULL;
  esp_err_t ret = esp_isp_new_awb_controller(handle, &awb_cfg, &ctlr);
  if (!WcIspCheckRet("ISP AWB init", ret)) {
    return;
  }

  esp_isp_awb_cbs_t awb_cbs = {
    .on_statistics_done = WcIspAwbOnStatisticsDone,
  };

  ret = esp_isp_awb_register_event_callbacks(ctlr, &awb_cbs, NULL);
  if (!WcIspCheckRet("ISP AWB cb reg", ret)) {
    esp_isp_del_awb_controller(ctlr);
    return;
  }

  ret = esp_isp_awb_controller_enable(ctlr);
  if (!WcIspCheckRet("ISP AWB enable", ret)) {
    esp_isp_del_awb_controller(ctlr);
    return;
  }

  isp_awb_state.handle = ctlr;
  isp_awb_state.enabled = true;
  isp_awb_state.gain_r = 1.0f;
  isp_awb_state.gain_b = 1.0f;
  isp_awb_state.last_applied_gain_r = 1.0f;
  isp_awb_state.last_applied_gain_b = 1.0f;
  isp_awb_state.runtime_ccm_valid = false;
  isp_awb_state.min_counted = (uint32_t)WcClampInt(awb.getInt("min_counted", 2000), 1, 1000000);
  isp_awb_state.min_r_step = WcClampFloat(awb.getFloat("min_red_gain_step", 0.034f), 0.0f, 1.0f);
  isp_awb_state.min_b_step = WcClampFloat(awb.getFloat("min_blue_gain_step", 0.034f), 0.0f, 1.0f);

  isp_awb_state.stats_ready = false;
  isp_awb_state.stats_seq = 0;
  isp_awb_state.cb_count = 0;
  isp_awb_state.last_consumed_seq = 0;
  memset(&isp_awb_state.latest_stats, 0, sizeof(isp_awb_state.latest_stats));

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP AWB initialized"));
}

/*********************************************************************************************/

// AWB Processing Loop - called from xdrv_81 FUNC_EVERY_250_MSECOND (4Hz)
// Grey-world algorithm: gain_r = avg_G/avg_R, gain_b = avg_G/avg_B
// Applied as diagonal correction on base CCM
void WcIspStartAWB(void) {
  if (!isp_awb_state.enabled || !isp_awb_state.handle) {
    AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP AWB start skipped - not ready"));
    return;
  }

  isp_awb_state.stats_ready = false;
  isp_awb_state.stats_seq = 0;
  isp_awb_state.cb_count = 0;
  isp_awb_state.last_consumed_seq = 0;
  memset(&isp_awb_state.latest_stats, 0, sizeof(isp_awb_state.latest_stats));

  esp_err_t ret = esp_isp_awb_controller_start_continuous_statistics(isp_awb_state.handle);
  if (ret != ESP_OK) {
    AddLog(LOG_LEVEL_ERROR, PSTR("CAM: ISP AWB continuous start failed (0x%x)"), ret);
    return;
  }

  AddLog(LOG_LEVEL_INFO, PSTR("CAM: ISP AWB continuous started AFTER stream start"));
}


void WcIspAwbProcess(void) {
  if (!isp_awb_state.enabled || !isp_awb_state.handle) return;

  uint32_t seq1 = isp_awb_state.stats_seq;
  if (seq1 & 1) {
    return;
  }

  isp_awb_stat_result_t stats = isp_awb_state.latest_stats;

  uint32_t seq2 = isp_awb_state.stats_seq;
  if (seq1 != seq2 || (seq2 & 1)) {
    return;
  }

  if (seq2 == isp_awb_state.last_consumed_seq) {
    return;
  }
  isp_awb_state.last_consumed_seq = seq2;

  if (stats.white_patch_num < isp_awb_state.min_counted) {
    return;
  }

  float avg_r = (float)stats.sum_r / (float)stats.white_patch_num;
  float avg_g = (float)stats.sum_g / (float)stats.white_patch_num;
  float avg_b = (float)stats.sum_b / (float)stats.white_patch_num;

  if (avg_g < 8.0f) return;
  if (avg_r < 1.0f) avg_r = 1.0f;
  if (avg_b < 1.0f) avg_b = 1.0f;

  // AFTER_CCM => avg_g/avg_r a avg_g/avg_b residuals, not absolute gains

  float residual_r = avg_g / avg_r;
  float residual_b = avg_g / avg_b;

  // limit step correction
  residual_r = WcClampFloat(residual_r, 0.75f, 1.33f);
  residual_b = WcClampFloat(residual_b, 0.75f, 1.33f);

  float target_gain_r = isp_awb_state.gain_r * residual_r;
  float target_gain_b = isp_awb_state.gain_b * residual_b;

  target_gain_r = WcClampFloat(target_gain_r, 0.5f, 2.0f);
  target_gain_b = WcClampFloat(target_gain_b, 0.5f, 2.0f);

  const float alpha = 0.35f;

  float new_gain_r = isp_awb_state.gain_r + (target_gain_r - isp_awb_state.gain_r) * alpha;
  float new_gain_b = isp_awb_state.gain_b + (target_gain_b - isp_awb_state.gain_b) * alpha;

