arendst/Tasmota/tasmota/tasmota_xdrv_driver/xdrv_81_0_esp32_webcam_CSI_isp.ino
  if (fabsf(new_gain_r - isp_awb_state.gain_r) < isp_awb_state.min_r_step &&
      fabsf(new_gain_b - isp_awb_state.gain_b) < isp_awb_state.min_b_step) {
    return;
  }

  isp_awb_state.gain_r = new_gain_r;
  isp_awb_state.gain_b = new_gain_b;

  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: AWB residual R=%.3f B=%.3f -> gain R=%.3f B=%.3f"),
         residual_r, residual_b,
         isp_awb_state.gain_r, isp_awb_state.gain_b);
}


void WcIspAutoProcess(void) {
  if (Wc.core.state != CAM_STREAMING) {
    return;
  }

  WcIspAeProcess();
  WcIspApplyRuntimeBf();
  WcIspAwbProcess();
  WcIspApplyRuntimeCcm();
}
/*********************************************************************************************/

// Deinitialize AWB - called when streaming stops
void WcIspDeinitAWB(void) {
  WcIspDeinitAE();

  if (!isp_awb_state.handle) return;

  isp_awb_state.enabled = false;
  
  memset(isp_awb_state.base_ccm, 0, sizeof(isp_awb_state.base_ccm));
  isp_awb_state.base_ccm[0][0] = 1.0f;
  isp_awb_state.base_ccm[1][1] = 1.0f;
  isp_awb_state.base_ccm[2][2] = 1.0f;

  isp_proc_handle_t isp = Wc.core.isp_handle;
  if (!isp) {
    isp_awb_state.handle = NULL;
    return;
  }

  esp_isp_awb_controller_stop_continuous_statistics(isp_awb_state.handle);
  esp_isp_awb_controller_disable(isp_awb_state.handle);
  esp_isp_del_awb_controller(isp_awb_state.handle);
  isp_awb_state.handle = NULL;
  isp_awb_state.gain_r = 1.0f;
  isp_awb_state.gain_b = 1.0f;
  isp_awb_state.last_applied_gain_r = 1.0f;
  isp_awb_state.last_applied_gain_b = 1.0f;
  isp_awb_state.runtime_ccm_valid = false;
  isp_awb_state.stats_ready = false;
  isp_awb_state.stats_seq = 0;
  isp_awb_state.cb_count = 0;
  isp_awb_state.last_consumed_seq = 0;

  isp_bf_state.enabled = false;
  isp_bf_state.last_profile_idx = -1;
  isp_bf_state.last_apply_ms = 0;

  isp_sensor_ae_state.valid = false;
  isp_sensor_ae_state.vts = 0;
  isp_sensor_ae_state.exposure_lines = 0;
  isp_sensor_ae_state.analog_gain = 0x10;
  isp_sensor_ae_state.digital_gain = 0x0400;

  memset(&isp_awb_state.latest_stats, 0, sizeof(isp_awb_state.latest_stats));
  AddLog(LOG_LEVEL_DEBUG, PSTR("CAM: ISP AWB deinitialized"));
}

#endif // ESP_IDF_VERSION >= 5.5.0
#endif // USE_CSI_WEBCAM
#endif // ESP32
